CSI API ETABS v1
cCaseHyperStatic Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cCaseHyperStatic
Public Interface cCaseHyperStatic
Dim instance As cCaseHyperStatic
public interface class cCaseHyperStatic
type cCaseHyperStatic =  interface end
The cCaseHyperStatic type exposes the following members.
Methods
Name | Description
GetBaseCase
 Retrieves the base case for the specified hyperstatic load case
SetBaseCase
 Sets the base case for the specified hyperstatic load case
SetCase
 Initializes a hyperstatic load case. If this function is called for an existing load case, all items for the case are reset to their default value
Top
See Also
Reference
ETABSv1 Namespace